# SQL Assignment

In [1]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [2]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [5]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [6]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [7]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

In [8]:
cursor = conn.execute("UPDATE Movie SET year = CAST(SUBSTR(year, -4) AS INTEGER)")
conn.commit()

In [9]:
cursor = conn.execute("UPDATE Movie SET MID = TRIM(MID)")
conn.commit()

In [10]:
cursor = conn.execute("UPDATE M_Location SET MID = TRIM(MID)")
conn.commit()

In [11]:
cursor = conn.execute("UPDATE M_Country SET MID = TRIM(MID)")
conn.commit()

In [12]:
cursor = conn.execute("UPDATE M_Language SET MID = TRIM(MID)")
conn.commit()

In [13]:
cursor = conn.execute("UPDATE M_Genre SET MID = TRIM(MID)")
conn.commit()

In [14]:
cursor = conn.execute("UPDATE Person SET PID = TRIM(PID)")
conn.commit()

In [15]:
cursor = conn.execute("UPDATE M_Producer SET MID = TRIM(MID)")
cursor = conn.execute("UPDATE M_Producer SET PID = TRIM(PID)")
conn.commit()

In [16]:
cursor = conn.execute("UPDATE M_Director SET MID = TRIM(MID)")
# Column: PID 
cursor = conn.execute("UPDATE M_Director SET PID = TRIM(PID)")
# Column: ID 
cursor = conn.execute("UPDATE M_Director SET ID = TRIM(ID)")

conn.commit()

In [17]:
cursor = conn.execute("UPDATE M_Cast SET MID = TRIM(MID)")
# Column: PID
cursor = conn.execute("UPDATE M_Cast SET PID = TRIM(PID)")
# Column: ID 
cursor = conn.execute("UPDATE M_Cast SET ID = TRIM(ID)")

conn.commit()

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [18]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """SELECT p.name, m.title, m.year 
 FROM Person p, M_Director md, Movie m, M_Genre mg, Genre g 
 WHERE g.Name LIKE '%Comedy%' 
 AND g.GID = mg.GID 
 AND mg.MID = m.MID 
 AND m.MID = md.MID  
 AND md.PID = p.PID 
 AND m.year IN (SELECT year FROM Movie WHERE year%4 = 0 AND year%400 = 0 OR year%4 = 0 AND year%100 != 0)"""
grader_1(query1)

                Name                              title  year
0       Milap Zaveri                         Mastizaade  2016
1       Danny Leiner  Harold & Kumar Go to White Castle  2004
2     Anurag Kashyap                 Gangs of Wasseypur  2012
3       Frank Coraci        Around the World in 80 Days  2004
4      Griffin Dunne             The Accidental Husband  2008
5        Anurag Basu                             Barfi!  2012
6    Gurinder Chadha                  Bride & Prejudice  2004
7         Mike Judge    Beavis and Butt-Head Do America  1996
8   Tarun Mansukhani                            Dostana  2008
9       Shakun Batra                      Kapoor & Sons  2016
Wall time: 159 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [19]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """SELECT p.Name FROM Movie m 
    JOIN M_Cast mc ON m.MID=mc.MID
    JOIN Person p ON mc.PID=p.PID
    WHERE m.title='Anand' AND m.year=1971"""
grader_2(query2)

                Name
0   Amitabh Bachchan
1      Rajesh Khanna
2     Brahm Bhardwaj
3         Ramesh Deo
4          Seema Deo
5         Dev Kishan
6        Durga Khote
7      Lalita Kumari
8       Lalita Pawar
9       Atam Prakash
Wall time: 346 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [20]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
Wall time: 492 ms

In [21]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """ SELECT DISTINCT p.Name
        FROM Movie m
                 JOIN M_Cast mc ON m.MID = mc.MID
                 JOIN Person p ON mc.PID = p.PID
        WHERE m.year > 1990
          AND p.PID IN (SELECT DISTINCT p.PID as pid
                              FROM Movie m
                                       JOIN M_Cast mc ON m.MID = mc.MID
                                       JOIN Person p ON mc.PID = p.PID
                              WHERE m.year < 1970)
        GROUP BY p.PID """
grader_3(query3)

                  Name
0     Amitabh Bachchan
1   Mohandas K. Gandhi
2                Rekha
3           Dharmendra
4    Prithviraj Kapoor
5        Shammi Kapoor
6        Shashi Kapoor
7        Rajesh Khanna
8          Hema Malini
9          Sanjay Dutt
Wall time: 1.24 s

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [28]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a =""" SELECT p.PID, count(md.ID) movieCount FROM M_Director md JOIN Person p ON md.PID=p.PID
        GROUP BY md.PID ORDER BY movieCount """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

         PID  movieCount
0  nm0000180           1
1  nm0000187           1
2  nm0000229           1
3  nm0000269           1
4  nm0000386           1
5  nm0000965           1
6  nm0001060           1
7  nm0001162           1
8  nm0001241           1
9  nm0001355           1
True
Wall time: 107 ms

In [29]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ SELECT p.Name, count(md.ID) movieCount FROM M_Director md JOIN Person p ON md.PID=p.PID
        GROUP BY md.PID HAVING movieCount >= 10 ORDER BY movieCount DESC """
grader_4(query4)

                    Name  movieCount
0           David Dhawan          39
1           Mahesh Bhatt          35
2        Ram Gopal Varma          30
3           Priyadarshan          30
4           Vikram Bhatt          29
5   Hrishikesh Mukherjee          27
6            Yash Chopra          21
7         Shakti Samanta          19
8        Basu Chatterjee          19
9           Subhash Ghai          18
Wall time: 149 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [38]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))

query_5aa =""" SELECT Movie.MID , Gender as Gend, count(*) as count
FROM Movie
JOIN M_Cast ON Movie.MID = M_Cast.MID JOIN Person on M_Cast.PID = Person.PID
WHERE Gender ='Male' or Gender like '%None' or Gender like '%Female'
Group by Movie.MID """

print(grader_5aa(query_5aa))

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab =""" SELECT Movie.MID , Gender as Gend, count(Gender) as count
FROM Movie
JOIN M_Cast ON Movie.MID = M_Cast.MID JOIN Person on M_Cast.PID = Person.PID
WHERE Gender IN ('Male')
Group by Movie.MID """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID    Gend  count
0  tt0021594    Male      8
1  tt0026274    Male     20
2  tt0027256    Male     13
3  tt0028217    Male     10
4  tt0031580    Male     44
5  tt0033616    Male     53
6  tt0036077    Male     14
7  tt0038491  Female     10
8  tt0039654    Male     12
9  tt0040067    Male     15
False
         MID  Gend  count
0  tt0021594  Male      5
1  tt0026274  Male      9
2  tt0027256  Male      8
3  tt0028217  Male      7
4  tt0031580  Male     27
5  tt0033616  Male     46
6  tt0036077  Male     11
7  tt0038491  Male      7
8  tt0039654  Male      6
9  tt0040067  Male     10
True
Wall time: 1.05 s

In [39]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """SELECT m.year, COUNT(DISTINCT m.MID) Female_Cast_Only_Movies 
FROM Movie m 
WHERE m.MID NOT IN (SELECT mc.MID 
FROM M_Cast mc JOIN Person p ON p.PID = mc.PID 
WHERE p.Gender IN ('Male', 'None')) 
GROUP BY m.year"""
grader_5a(query5a)

   year  Female_Cast_Only_Movies
0  1939                        1
1  1999                        1
2  2000                        1
3  2018                        1
Wall time: 409 ms

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [40]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """SELECT query1.year, ((query1.Female_Cast_Only_Movies*100)/query2.Total_movies) AS Percentage_Female_Only_Movie, Total_movies  
FROM (SELECT m.year, COUNT(DISTINCT m.MID) Female_Cast_Only_Movies 
FROM Movie m 
WHERE m.MID NOT IN (SELECT mc.MID FROM M_Cast mc JOIN Person p ON p.PID = mc.PID WHERE p.Gender IN ('Male', 'None')) 
GROUP BY m.year) AS query1 
INNER JOIN 
(SELECT m1.year, COUNT(m1.MID) Total_movies 
FROM Movie m1 
GROUP BY m1.year) AS query2 
ON query1.year = query2.year """
grader_5b(query5b)

   year  Percentage_Female_Only_Movie  Total_movies
0  1939                            50             2
1  1999                             1            66
2  2000                             1            64
3  2018                             0           104
Wall time: 396 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [41]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ SELECT m.title, COUNT(DISTINCT mc.PID) as Cast_count 
FROM Movie m INNER JOIN M_Cast mc 
ON m.MID = mc.MID 
GROUP BY m.MID 
ORDER BY Cast_count DESC """
grader_6(query6)

                        title  Cast_count
0               Ocean's Eight         238
1                    Apaharan         233
2                        Gold         215
3             My Name Is Khan         213
4  Captain America: Civil War         191
5                    Geostorm         170
6                     Striker         165
7                        2012         154
8                      Pixels         144
9       Yamla Pagla Deewana 2         140
Wall time: 475 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [42]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

query7a = """  SELECT year as Year, COUNT(MID) as Total_Movies FROM Movie GROUP BY year """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   Year  Total_Movies
0  1931             1
1  1936             3
2  1939             2
3  1941             1
4  1943             1
5  1946             2
6  1947             2
7  1948             3
8  1949             3
9  1950             2
Wall time: 9.94 ms

In [43]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """   
    SELECT t1.Year, t1.Total_Movies, t2.Year,t2.Total_movies
FROM
(SELECT DISTINCT year as Year, COUNT(MID) as Total_Movies FROM Movie GROUP BY year) as t1,
(SELECT year as Year, COUNT(MID)as Total_Movies FROM Movie GROUP BY year) as t2
WHERE t2.year<=t1.year+9 and t1.year<=t2.year
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   Year  Total_Movies  Year  Total_Movies
0  1931             1  1931             1
1  1931             1  1936             3
2  1931             1  1939             2
3  1936             3  1936             3
4  1936             3  1939             2
5  1936             3  1941             1
6  1936             3  1943             1
7  1939             2  1939             2
8  1939             2  1941             1
9  1939             2  1943             1
Wall time: 15 ms

In [44]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ WITH unique_years AS
(SELECT DISTINCT year AS YEAR, year AS DECADE_START, year + 9 AS DECADE_END, 'Decade of : ' || year DECADE
FROM Movie),
movie_count_per_year AS 
(SELECT COUNT(DISTINCT MID) Movie_Count, year AS Year 
FROM Movie 
GROUP BY year),
movie_count_per_decade AS 
(SELECT SUM(Movie_Count) Total_Movies_per_decade, unique_years.DECADE
FROM movie_count_per_year, unique_years
WHERE movie_count_per_year.Year BETWEEN unique_years.DECADE_START AND unique_years.DECADE_END
GROUP BY unique_years.DECADE)

SELECT Decade, Total_Movies_per_decade
FROM movie_count_per_decade
WHERE Total_Movies_per_decade = (SELECT MAX(Total_Movies_per_decade) FROM movie_count_per_decade)"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

             DECADE  Total_Movies_per_decade
0  Decade of : 2008                     1203
Wall time: 35.9 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [45]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

query8a = """ SELECT pd.PID as Director, pa.PID as actor, COUNT(*) as Movies
FROM M_director d JOIN
     Person pd
     ON pd.pid = d.pid 
     JOIN
     M_cast c
     ON c.MID = d.MID JOIN
     Person pa
     ON pa.PID = c.PID
GROUP BY pd.pid, pa.pid"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

    Director      actor  Movies
0  nm0000180  nm0000027       1
1  nm0000180  nm0001114       1
2  nm0000180  nm0001919       1
3  nm0000180  nm0006762       1
4  nm0000180  nm0030062       1
5  nm0000180  nm0038970       1
6  nm0000180  nm0051856       1
7  nm0000180  nm0085966       1
8  nm0000180  nm0097889       1
9  nm0000180  nm0125497       1
Wall time: 1.02 s

In [46]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """ Select p.name,h.count 
from(select mc.pid as mcpid,md.pid as mdpid,count(mc.MID) as count   
from m_cast as mc
                 join m_director md 
                     on md.MID=mc.MID               
                 group by mc.pid ,md.pid 
                ) h
            join person p 
                on h.mcpid=p.pid
            where h.count = (select count(*) as count   
                             from m_cast as mc
                             join m_director md 
                                 on md.mid=mc.mid
                             where mc.pid=h.mcpid 
                             group by mc.pid,md.pid 
                             order by count(*) desc
                             limit 1)
            and h.mdpid = (select pid 
                           from person 
                           where name like '%Yash Chopra%'
                          )
            order by h.count desc"""
grader_8(query8)

                Name  count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4     Waheeda Rehman      5
5      Rakhee Gulzar      5
6     Achala Sachdev      4
7        Neetu Singh      4
8           Ravikant      4
9    Parikshat Sahni      3
(245, 2)
Wall time: 10.5 s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [47]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """SELECT distinct PID as S1_PID from 
        (SELECT DISTINCT m1.MID FROM Person p1 INNER JOIN M_Cast c1 ON p1.PID = TRIM(c1.PID) AND TRIM(p1.Name) = 'Shah Rukh Khan' \
     INNER JOIN Movie m1 ON m1.MID = c1.MID) t1
        INNER JOIN
    (SELECT p2.PID ,p2.Name,m2.MID FROM Person p2 INNER JOIN M_Cast c2 ON p2.PID = TRIM(c2.PID) AND TRIM(p2.Name) not LIKE '%Shah Rukh Khan%' \
     INNER JOIN Movie m2 ON m2.MID = c2.MID) t2
        on  t1.MID = t2.MID"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

      S1_PID
0  nm0004418
1  nm0008650
2  nm0028416
3  nm0110072
4  nm0117851
5  nm0163908
6  nm0172333
7  nm0196375
8  nm0201049
9  nm0212689
(2382, 1)
Wall time: 660 ms

In [48]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """ select name from
        (select distinct d2.PID , d2.Name from 
        (select  PID , MID ,title,Name from 
        (SELECT m3.MID,p3.PID,m3.title,p3.Name FROM Person p3 INNER JOIN M_Cast c3 ON p3.PID = TRIM(c3.PID) AND TRIM(p3.Name) not LIKE '%Shah Rukh Khan%' \
     INNER JOIN Movie m3 ON m3.MID = c3.MID)
     where PID in 
    
    (SELECT distinct PID from 
        (SELECT DISTINCT m1.MID FROM Person p1 INNER JOIN M_Cast c1 ON p1.PID = TRIM(c1.PID) AND TRIM(p1.Name) = 'Shah Rukh Khan' \
     INNER JOIN Movie m1 ON m1.MID = c1.MID) t1
        INNER JOIN
    (SELECT p2.PID ,p2.Name,m2.MID FROM Person p2 INNER JOIN M_Cast c2 ON p2.PID = TRIM(c2.PID) AND TRIM(p2.Name) not LIKE '%Shah Rukh Khan%' \
     INNER JOIN Movie m2 ON m2.MID = c2.MID) t2
        on  t1.MID = t2.MID)
        
    and MID not in (SELECT DISTINCT m1.MID FROM Person p1 INNER JOIN M_Cast c1 ON p1.PID = TRIM(c1.PID) AND TRIM(p1.Name) = 'Shah Rukh Khan' \
     INNER JOIN Movie m1 ON m1.MID = c1.MID))d1
     join 
     (select p4.PID,p4.Name,m4.MID from Person p4 INNER JOIN M_Cast c4 ON p4.PID = TRIM(c4.PID) AND TRIM(p4.Name) not LIKE '%Shah Rukh Khan%' \
     INNER JOIN Movie m4 ON m4.MID = c4.MID)d2
     
     on (d1.MID=d2.MID )
     where d2.PID not in (SELECT distinct PID from 
        (SELECT DISTINCT m1.MID FROM Person p1 INNER JOIN M_Cast c1 ON p1.PID = TRIM(c1.PID) AND TRIM(p1.Name) = 'Shah Rukh Khan' \
     INNER JOIN Movie m1 ON m1.MID = c1.MID) t1
        INNER JOIN
    (SELECT p2.PID ,p2.Name,m2.MID FROM Person p2 INNER JOIN M_Cast c2 ON p2.PID = TRIM(c2.PID) AND TRIM(p2.Name) not LIKE '%Shah Rukh Khan%' \
     INNER JOIN Movie m2 ON m2.MID = c2.MID) t2
        on  t1.MID = t2.MID))"""
grader_9(query9)

                    Name
0   Kristin Scott Thomas
1           Derek Jacobi
2             Nick Frost
3         Walton Goggins
4         Michael Obiora
5           Dominic West
6     Alexandre Willaume
7              Daniel Wu
8            Josef Altin
9         Jaime Winstone
(25698, 1)
Wall time: 7.02 s